       01  REG-AUDIOLIBRO.
           05 REG-AUDIOLIBRO-CLAVE.
              10 AUDIOLIBRO-ID            PIC 9(4).
           05 AUDIO-TITULO                PIC X(30).
           05 AUDIO-AUTOR                 PIC X(30).
           05 AUDIO-DURACION              PIC 9(4).
           05 AUDIO-PRECIO                PIC 9(3)V9(2).
           05 AUDIO-NUMREPLICAS           PIC 9(2).
           05 AUDIO-RESTRICCIONEDAD       PIC 9(2).
