       01  REG-CLIENTE.
           05 CLTEID              PIC 9(10).
           05 CLTE-NOMBRE         PIC X(30).
           05 CLTE-EDAD           PIC X(3).
