       01  REG-DET-REGISTRO.
           05 REG-DET-REGISTRO-CLAVE.
              10 DET-REGISTRO-ID         PIC 9(2).
              10 DET-REGISTROAL-ID       PIC 9(5).
              10 DET-CLTE-ID             PIC 9(10).
           05 DET-LIBROID                PIC 9(4).
           05 DET-AUDIOLIBROID           PIC 9(4).
           05 SUBTOTAL                   PIC 9(4)V9(2).
