       01  REG-PAGO.
           05 REG-PAGO-CLAVE.
              10 PAGOID             PIC 9(4).
              10 PAGO-REG-AL-ID     PIC 9(5).
           05 PAGO-CLTE-ID          PIC 9(10).
           05 PAGO-ESTADO           PIC X(15).
