       01  REG-REGISTRO-ALQUILER.
           05 REG-REG-ALQUILER-CLAVE.
              10 ALQUILER-ID           PIC 9(5).
              10 ALQUILER-CLTE-ID      PIC 9(10).
           05 FECHA-REGISTRO           PIC 9(8).
           05 FECHA-ENTREGA            PIC 9(8).
           05 VALOR-TOTAL              PIC 9(4)V9(2).
